Repository: ManikantaSirumalla/FlickrrApp
Catalog: FlickrrApp/*.lproj/Localizable.strings
Languages: te_in

source: Search photos here...
te_in: ఫోటోలను ఇక్కడ శోధించండి...

source: Cannot fetch photos!
te_in: ఫోటోలను పొందడం సాధ్యం కాదు!

source: Flickrr photos
te_in: Flickrr ఫోటోలు

source: Cannot fetch description!
te_in: వివరణ అందుబాటులో లేదు

source: More info:
te_in: మరింత సమాచారం:

source: No description available
te_in: వివరణ పొందడం సాధ్యం కాదు!

source: Okay
te_in: సరే

source: URL isn't valid
te_in: URL చెల్లదు

source: Data was not retrieved
te_in: డేటా తిరిగి పొందబడలేదు

source: No internet connection
te_in: ఇంటర్నెట్ కనెక్ట్ కాలేదు

source: Invalid data response
te_in: డేటా ప్రతిస్పందన చెల్లదు

source: No data available
te_in: సమాచారం అందుబాటులో లేదు

source: Something went wrong
te_in: ఎక్కడో తేడ జరిగింది
